CSI API ETABS v1
cCaseResponseSpectrum.GetDampOverrides Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDampOverrides(
	string Name,
	ref int NumberItems,
	ref int[] Mode,
	ref double[] Damp
)
Function GetDampOverrides (
	Name As String,
	ByRef NumberItems As Integer,
	ByRef Mode As Integer(),
	ByRef Damp As Double()
) As Integer
Dim instance As cCaseResponseSpectrum
Dim Name As String
Dim NumberItems As Integer
Dim Mode As Integer()
Dim Damp As Double()
Dim returnValue As Integer
returnValue = instance.GetDampOverrides(Name,
	NumberItems, Mode, Damp)
int GetDampOverrides(
	String^ Name,
	int% NumberItems,
	array<int>^% Mode,
	array<double>^% Damp
)
abstract GetDampOverrides :
        Name : string *
        NumberItems : int byref *
        Mode : int[] byref *
        Damp : float[] byref -> int
Parameters
Name
Type: System.String
NumberItems
Type: System.Int32
Mode
Type: System.Int32[]
Damp
Type: System.Double[]
Return Value
Type: Int32
See Also
Reference
cCaseResponseSpectrum Interface
ETABSv1 Namespace